<header class="header">

    <div class="header__container">

        <div class="container header__container_top">
            
            <img class="header__logo" src="/logo/logo_ok.png" alt="Logo">

            <ul class="header__links flex">
                <li class="header__item">
                    <svg width="44" height="31" viewbox="0 0 44 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M40.1328 0H3.86719C1.73052 0 0 1.74127 0 3.86719V27.0703C0 29.2089 1.74324 30.9375 3.86719 30.9375H40.1328C42.2516 30.9375 44 29.2162 44 27.0703V3.86719C44 1.74505 42.2764 0 40.1328 0ZM39.5912 2.57812C38.8011 3.36402 25.204 16.8896 24.7345 17.3565C24.0041 18.087 23.033 18.4892 22 18.4892C20.967 18.4892 19.9959 18.0869 19.2631 17.3541C18.9473 17.04 5.50026 3.66386 4.40877 2.57812H39.5912ZM2.57812 26.5456V4.39355L13.7189 15.4756L2.57812 26.5456ZM4.4104 28.3594L15.5468 17.2938L17.4425 19.1795C18.6599 20.3969 20.2784 21.0673 22 21.0673C23.7216 21.0673 25.3401 20.3969 26.5551 19.1819L28.4532 17.2938L39.5896 28.3594H4.4104ZM41.4219 26.5456L30.2811 15.4756L41.4219 4.39355V26.5456Z"
                        fill="#FFBF00" />
                    </svg>

                    <span class="header__email header__link_email">emailaddres@gmail.com</span>
                </li>
                <li class="header__item">
                    <svg width="30" height="30" viewbox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M12.4236 17.5764C9.56034 14.7131 8.91382 11.8498 8.76797 10.7026C8.72721 10.3854 8.83637 10.0673 9.0633 9.84199L11.3804 7.52592C11.7213 7.18528 11.7817 6.6544 11.5263 6.24582L7.83699 0.517188C7.55434 0.0647571 6.97399 -0.0985297 6.49689 0.140141L0.574309 2.92946C0.1885 3.11944 -0.038428 3.52935 0.00537641 3.95716C0.315703 6.90526 1.60097 14.1524 8.72297 21.2749C15.845 28.3975 23.0911 29.6822 26.0408 29.9925C26.4686 30.0363 26.8785 29.8094 27.0684 29.4236L29.8578 23.501C30.0955 23.0249 29.9333 22.4462 29.4828 22.163L23.7542 18.4748C23.3458 18.219 22.815 18.2791 22.4741 18.6196L20.158 20.9367C19.9326 21.1636 19.6145 21.2728 19.2974 21.232C18.1502 21.0862 15.2869 20.4396 12.4236 17.5764Z"
                        fill="#FFBF00" />
                    <path
                        d="M23.7935 16.0335C23.2222 16.0335 22.759 15.5704 22.759 14.9991C22.7542 10.7164 19.2836 7.24575 15.0009 7.2409C14.4296 7.2409 13.9665 6.77778 13.9665 6.20648C13.9665 5.63518 14.4296 5.17206 15.0009 5.17206C20.4257 5.17804 24.8219 9.57424 24.8279 14.9991C24.8279 15.5704 24.3648 16.0335 23.7935 16.0335Z"
                        fill="#FFBF00" />
                    <path
                        d="M28.9656 16.0335C28.3943 16.0335 27.9312 15.5704 27.9312 14.9991C27.9232 7.86124 22.1388 2.07683 15.0009 2.06884C14.4296 2.06884 13.9665 1.60572 13.9665 1.03442C13.9665 0.463127 14.4296 0 15.0009 0C23.2809 0.00912147 29.9909 6.71912 30 14.9991C30 15.2735 29.891 15.5366 29.697 15.7306C29.503 15.9246 29.2399 16.0335 28.9656 16.0335Z"
                        fill="#FFBF00" />
                    </svg>
                    <a href="tel:1234567890" class="header__link header__link_tel">+7-123-456-78-90</a>
                </li>
            </ul>

            <div>
                <?php
                
                    if (isset($_SESSION["id"]) && isset($_SESSION["login"])) {
                        echo "<button class='header__link_enter' id='header__link_exit'>Выйти</button>";
                    } else {
                        echo "<button class='header__link_enter' id='header__link_enter'>Войти</button>";
                    }
                
                ?>                
            </div>
        </div>
    </div>

    <div class="container nav__container">
        <nav class="nav">
            <ul class="nav__links flex-right">
                <li class="nav__item"><a class="nav__link" href="/index.php">На главную</a></li>
                <li class="nav__item"><a class="nav__link" href="#">О наc</a></li>
                <li class="nav__item"><a class="nav__link" href="#">Контакты</a></li>
                <li class="nav__item"><a class="nav__link" href="">Уведомления</a></li>
                <li class="nav__item"><a class="nav__link" href="/php/pages/cabinet.php" id="cabinetButton">Личный кабинет</a></li>
            </ul>
        </nav>
    </div>

</header>